import 'dart:ui';

import 'package:aps_party/layers/data/utils/app_color.dart';
import 'package:aps_party/layers/data/utils/app_images.dart';
import 'package:aps_party/layers/domain/entity/banner_member.dart';
import 'package:aps_party/main.dart';
import 'package:cached_network_image/cached_network_image.dart';
import 'package:flutter/material.dart';
import 'package:responsive_sizer/responsive_sizer.dart';

class PartyAgendaHistroy extends StatefulWidget {
  const PartyAgendaHistroy({super.key});

  @override
  State<PartyAgendaHistroy> createState() => _MyWidgetState();
}

class _MyWidgetState extends State<PartyAgendaHistroy> {
  bool isplay = false;

  String para = "Party Agenda आजाद समाज पार्टी काशीराम प्रतिज्ञा पत्र आदरणीय भाईयों बहनों माताओं एवं बुर्जुगों  आजाद समाज पार्टी ( कांशीराम ) मजदूरों तथा किसानों व महिलाओं के ऊपर हो रहे अत्याचार  शोषण व्यभिचार तथा वर्तमान भाजपा सरकार जनहित विरोधी कानून बनाकर किसान मजदूर व अल्पसंख्यक समाज को दमन के विभिन्न तरीके अपनाकर समाज के इन वर्गो का विकास की मुख्यधारा से अलग अलग कर दमन के विभिन्न तरीके अपनाकर समाज के इन वर्गों को मजबूर व लाचार बना देना चाहती है ।  साथियो! आजाद समाज पार्टी न केवल एक राजनैतिक पार्टी बल्कि वंचित समाज में जन्में महापुरूषों के सामाजिक परिवर्तन आर्थिक मुक्ति और स्वाभिमान के सपनों को साकार करने का एक आन्दोलन है । महापुरूषो के मिशन को जिन्दा रखने के लिए राष्ट्रव्यापी  संगठन के निर्माण हेतु जिसमें संगठन सर्वोच्च हो । सम्पूर्ण भारत में भ्रमण व सम्पर्क के पश्चात समाज के चिन्तनशील बुद्धिजीवियों के विचार  विमर्श के द्वारा महापुरूषों का आन्दोलन व हक वंचित समाज का अस्तित्व बचाने के लिए  परिवार वाद से मुक्त लोकतंत्र से युक्त  संगठनात्मक जोश से लबरेज नई पीढ़ी के युवा नेतृत्व को उभारने के लिए  व्यवस्था परिवर्तन  के लिए समर्पित आजाद समाज पार्टी  मान्यवर कांशीराम साहब के जन्मदिवस 15 मार्च सन् 2020 को स्थापना की।ताकि देश के साधन संसाधन और उद्योग व्यापार के साथ साथ सरकारी और प्राईवेट सेक्टर की नौकरियों आदि सभी क्षेत्रों में उपेक्षित और वंचित वर्गों को इस देश में हिस्सेदारी मिल सके अर्थात ओ •बी• सी• का 52 प्रतिशत एस•सी• एस• टी• का 30 प्रतिशत अल्पसंख्यकों का 18 प्रतिशत हिस्से के साथ हक़ वंचित वर्गों की सामाजिक आज़ादी आर्थिक मुक्ति और राजनैतिक पहचान को इस देश में सुनिश्चित किया जा सके आजाद समाज पार्टी यह प्रतिज्ञा लेकर जनता के बीच में आयी है कि आजाद समाज पार्टी की सरकार आने पर इन प्रतिज्ञाओं को पूरा किया जायेगा अन्यथा विपक्ष में रहकर जनहित के इन मुद्दों के लिए लगातार संघर्ष व आन्दोलन किया जायेगा । ये है हमारी प्रतिज्ञाएं किसी भी सरकारी  गैर सरकारी एवं मजदूर की डयूटी के दौरान मौत होने पर उसके परिवार को एक करोड़ रूपए का मुआवजा तथा उसके परिवार के एक सदस्य को उसकी योग्यता अनुसार सरकारी नौकरी दी जाएगी। 2 राष्ट्रपति हो या मजदूर की संतान शिक्षा हो सबको एक समान सिद्धान्त के तहत  समान एवं अनिवार्य शिक्षा जिसमें सभी के लिए समान पाठ्यक्रम समान माध्यम एवं समान मूल्यांकन प्रणाली एवं विशेष रूप से भारतीय संविधान के अध्ययन व अध्यापन को बढ़ावा दिया जायेगा । 3 प्राकृतिक आपदाओं कृषि में सूखा  बाढ़ ओलावृष्टि इत्यादि में किसानों के साथ  साथ खेतों में काम करने वाले खेतीहर मज़दूरों को भी क्षति पूर्ति मुआवजा दिया जायेगा 4 समाज के कमजोर वर्गो तथा गरीबी रेखा से नीचे जीवन व्यतीत करने वाले परिवारों को मासिक 200 यूनिट मुफ्त बिजली व फ्री चिकित्सा बीमा के साथ समाज के कमजोर वर्गा की रोटी कपड़ा मकान की समुचित व्यवस्था के लिए हम प्रतिबद्ध है  5 प्रदेश के हर गरीब परिवार की लडकियों को 12 वीं तक मुफ्त शिक्षा  वज़ीफ़ा तथा स्कूल कॉलेज तक आने जाने के लिए फ्री बस सेवा जिन ग्रामीण इलाको कसबों में बस सेवा नही होगी वहाँ स्कूल जाने वाली बच्चियों के लिए मुफ्त साईकिल उपलब्ध कराने का काम करेंगे  6 कच्ची पक्की कालोनियों व ग्रामीण क्षेत्र के विकास के लिए सड़क नाली पानी व सीवर विकसित करके स्वच्छ व सुंदर वातावरण बनाया जाएगा  7 आजाद भारत के 70 साल बीत जाने पर प्रदेश में अभी भी 8-10 प्रतिशत जनसंख्या झुग्गी झोपडी  फुटपाथ  रेलवे स्टेशन या फिर खुली छत के नीचे सोने के लिए मजबूर है । ऐसे लोगों के लिए सरकारी खर्च पर रेन बसेरा या फिर उनके लिए छोटे आवास की व्यवस्था करने का काम करेगी  8 मॉब लिंचिंग एक तरह की प्रायोजित हिंसा है उसमें शामिल अपराधियों को सख्त सज़ा का कानूनी प्रावधान के साथ ही अल्पसंख्यक समुदाय के विकास के लिए स्कूल मदरसे का विशेष प्रावधान किया जाएगा तथा उनको चलाने के लिए एनजीओ को ग्रांट देकर पिछडे समुदाय को देश की मुख्य विकास धारा में शामिल करने का काम किया जायेगा 9 एससी  एसटी  ओबीसी के लिए उपलब्ध संवैधानिक आरक्षण व्यवस्था को जमीनी स्तर पर 100 प्रतिशत लागू करने का काम किया जाएगा । आरक्षण को संविधान की 9वीं अनुसूची में डाला जाए तथा इन वर्गों के लिए निजी क्षेत्रों में भी कम्पलसरी रूप से आरक्षण मिले इसके लिए कठोर कानूनी प्राविधान किया जायेगा । 10 ASP प्रदेश में सरकारी विभागों के अंतर्गत लाखों की संख्या में पड़े खाली पदों को सीधी भर्ती के द्वारा भरने का काम करेगी जिसमें आरक्षण को सख़्ती से लागू किया जाएगा । इसके साथ साथ बेरोजगार नौजवानों के लिए लघु उद्योग चलाने के लिए सस्ती दरों पर सरकारी बैंकों द्वारा लोन उपलब्ध कराकर उद्योग धंधे शुरू करने का काम करेगी जिससे कि अगले पाँच साल में प्रदेश में कोई भी बेरोज़गार नहीं रहेगा 11 साथ ही निजीकरण को समाप्त करने के लिए हमारी सरकार प्रत्येक विभाग का सरकारीकरण करके उनमें योग्य व देश प्रेमी लोगों की भर्ती कर सरकारी विभागों द्वारा प्रदेश के चहुँमुखी विकास के लिए काम करेगी जिससे पूजीवादी व्यवस्था को खत्म किया जा सके 12 सरकारी विभागों में लाखों की संख्या में काम कर रहे कच्चे कर्मचारियों का हमारी पार्टी की सरकार बनने के बाद उन्हें 3 महीने के अंदर स्थाई व पक्की नौकरी देने का काम किया जाएगा। 13 हम महिला सुरक्षा व महिला रोजगार प्लान लाकर महिलाओ को आत्मनिर्भर और स्वावलंबी बनाने का काम करेंगे । इसके साथ ही महिलाओं के लिए 30 प्रतिशत आरक्षण सभी विभागों में लागू किया जायेगा । इतना ही नहीं हमारी सरकार महिलाओं पर हो रहे अत्याचार को समाप्त करने के लिए पुलिस विभाग में 30 प्रतिशत पदों पर महिला कर्मचारियों की नियुक्ति करने का काम करेगी जिससे कि वह स्वयं तथा अन्य महिला वर्ग की सुरक्षा कर सके। 14 किसानों को उनकी फसलों का उचित मूल्य तथा एमएसपी लागू करने के लिए हमारी पार्टी की सरकार प्रदेश में किसानों के विकास हेतु कानून बनाएगी तथा मौजूदा सरकार द्वारा किसान विरोधी कानून का बहिष्कार करते हुए प्रदेश में इसे लागू नहीं होने देगी 15 मुस्लिम समाज के लिए सच्चर कमेटी की रिपोर्ट पर तुरन्त अमल होना चाहिए । मौजूदा सरकार द्वारा बनाए गए नागरिकता विरोधी कानून ( सी०ए०ए० ) को उत्तर प्रदेश में लागू न करने की गारन्टी तथा प्रत्येक धर्म जाति समुदाय के लोगों को संविधान में दिये गए अधिकार व सुविधाओं को सख़्ती से लागू करने का काम करेगी  16 पुलिस के प्रत्येक थाने में एससी  एसटी  ओबीसी  अल्पसंख्यक  महिला वर्ग से एक एक कर्मचारी की तैनाती की जाएगी जिससे कि पुलिस स्तर पर हो रहे जातिगत अत्याचार को समाप्त किया जा सके 17 देश में जो भी पार्टी अडाणी अंबानी की कम्पनियों का राष्ट्रीयकरण करेगी हमारी पार्टी ऐसे राजनैतिक दल का समर्थन करेगी 18 उच्च शिक्षा  संस्थानों में स्वायत्ता घोषित करके वहाँ आरक्षण व्यवस्था को खत्म करने का पडयन्त्र सरकार कर रही है उसे तत्काल रोका जायेगा तथा युवा प्रतिभाओं को निखारने को लिए विदेशी यूनिवर्सिटी में अध्ययन हेतु प्रतिवर्ष 10,000 छात्रों को अध्ययन हेतु सरकारी खर्च पर विदेश में भेजने का कार्य करेगें 19 सफाई कर्मचारियों की संविदा व्यवस्था ( Contract System ) रद्द करके उनको पहले जैसे सरकारी नौकरी में लिया जाये 20 ओबीसी जातियों की जाति आधारित गिनती होनी ही चाहिए । एवं मंडल कमीशन की सभी सिफ़ारिशें पूर्ण रूप से लागू होनी चाहिएँ इसके लिए हम संकल्पबद्ध है। 22 महंगाई की मार को देखते हुए  टोल प्लाजा टैक्स फ्री करते हुए आजाद समाज पार्टी डीजल  पेट्रोल  रसोईगैस को जीएसटी को दायरे में लाने का काम करेगी तथा प्रदेश सरकार द्वारा लगाई जा रही भरकम टैक्स डयूटी को कम करके डीज़ल पेट्रोल को 40 से 50 रूपये प्रति लीटर देने के साथ साथ रसोई गैस की कीमत को आम उपभोक्ता के दायरे में लाने का काम करेगी जीना कोई बहुत बड़ी बात नहीं  बड़ी बात है स्वाभिमान से जीना। बाबा साहब डा भीम राव अम्बेडकर जगाया उसे जाता है जो ज़िंदा होते है मरे हुओ को तो दफनाया या जलाया जाता है जिन्दा हो तो नजर आओं नहीं तो दुनिया आपको मरा हुआ समझ लेगी और आपको मिट्टी में दफना देगी बहुजन नायक मान्यवर कांशीराम";


  Future<void> _speak(String p) async {
    await flutterTts.speak(p);
    flutterTts.setCompletionHandler(() {
      setState(() {
        isplay = false;
      });
    });
  }

  Future<void> _stop() async {
    await flutterTts.stop();
  }

  @override
  Widget build(BuildContext context) {
    final double h = MediaQuery.of(context).size.height;
    final double w = MediaQuery.of(context).size.width;
    return Scaffold(
      body: SingleChildScrollView(
        child: Padding(
          padding:
              EdgeInsets.only(bottom: MediaQuery.of(context).viewInsets.bottom),
          child: ClipRRect(
            child: BackdropFilter(
              filter: ImageFilter.blur(sigmaX: 15, sigmaY: 15),
              child: Container(
                  padding: EdgeInsets.all(10),
                  // height: h * 0.45,
                  width: double.infinity,
                  child: Column(
                    mainAxisSize: MainAxisSize.min,
                    children: [
                      Column(
                        mainAxisAlignment: MainAxisAlignment.start,
                        crossAxisAlignment: CrossAxisAlignment.start,
                        children: [
                          SizedBox(
                            width: 2.h,
                          ),
                          Stack(
                            children: [
                              ClipRRect(
                                borderRadius: BorderRadius.circular(10),
                                child: Container(
                                  height: 35.h,
                                  width: MediaQuery.of(context).size.width,
                                  margin: EdgeInsets.only(left: 1.0, right: 1),
                                  decoration: BoxDecoration(
                                      borderRadius: BorderRadius.circular(8),
                                      color: Colors.white,
                                      image: DecorationImage(
                                          image: AssetImage(AppImages.chandra),
                                          fit: BoxFit.fill)),
                                ),
                              ),
                              Positioned(
                                right: 1.h,
                                bottom: 2.h,
                                child: Container(
                                  child: Padding(
                                    padding: const EdgeInsets.symmetric(
                                        horizontal: 10, vertical: 10),
                                    child: !isplay
                                        ? InkWell(
                                            onTap: () {
                                              _speak(para.toString());
                                              setState(() {
                                                isplay = true;
                                              });
                                            },
                                            child: Icon(
                                              Icons.play_circle_fill_outlined,
                                              color: Colors.white,
                                            ))
                                        : InkWell(
                                            onTap: () {
                                              _stop();
                                              setState(() {
                                                isplay = false;
                                              });
                                            },
                                            child: Icon(
                                              Icons
                                                  .play_circle_outline_outlined,
                                              color: Colors.green,
                                            )),
                                  ),
                                ),
                              ),
                              Positioned(
                                // top: 2.h,
                                left: 1.h,
                                // right: 0,
                                bottom: 2.h,
                                child: SizedBox(
                                    child: Container(
                                  decoration: BoxDecoration(
                                    borderRadius: BorderRadius.only(
                                        topRight: Radius.circular(10),
                                        bottomLeft: Radius.circular(10)),
                                    color:
                                        AppColors.primarycolor.withOpacity(0.6),
                                  ),
                                  child: Padding(
                                    padding: const EdgeInsets.symmetric(
                                        horizontal: 10, vertical: 10),
                                    child: const Text(
                                      "Party Agenda",
                                      style: TextStyle(
                                          fontSize: 20,
                                          fontWeight: FontWeight.w600,
                                          color: Colors.white),
                                    ),
                                  ),
                                )),
                              ),
                            ],
                          ),
                          Padding(
                            padding: const EdgeInsets.symmetric(
                                horizontal: 0, vertical: 20),
                            child: Column(
                              crossAxisAlignment: CrossAxisAlignment.start,
                              children: [
                                Text(
                                  'आजाद समाज पार्टी ( काशीराम ) ',
                                  style: TextStyle(fontSize: 16),
                                ),
                                Text(
                                  'प्रतिज्ञा – पत्र ',
                                  style: TextStyle(fontSize: 16),
                                ),
                              ],
                            ),
                          ),
                          Padding(
                            padding: const EdgeInsets.symmetric(
                                horizontal: 0, vertical: 0),
                            child: Text(
                              'आदरणीय भाईयों , बहनों , माताओं एवं बुर्जुगों ! ',
                              style: TextStyle(fontSize: 16),
                            ),
                          ),
                          Padding(
                            padding: const EdgeInsets.symmetric(
                                horizontal: 04, vertical: 30),
                            child: Text(
                              "आजाद समाज पार्टी ( कांशीराम ) मजदूरों तथा किसानों व महिलाओं के ऊपर हो रहे अत्याचार , शोषण व्यभिचार तथा वर्तमान भाजपा सरकार जनहित विरोधी कानून बनाकर किसान मजदूर व अल्पसंख्यक समाज को दमन के विभिन्न तरीके अपनाकर समाज के इन वर्गो का विकास की मुख्यधारा से अलग अलग कर दमन के विभिन्न तरीके अपनाकर समाज के इन वर्गों को मजबूर व लाचार बना देना चाहती है । \n साथियो! आजाद समाज पार्टी न केवल एक राजनैतिक पार्टी,बल्कि वंचित समाज में जन्में महापुरूषों के सामाजिक,परिवर्तन, आर्थिक मुक्ति और स्वाभिमान के सपनों को साकार करने का एक आन्दोलन है । महापुरूषो के मिशन को जिन्दा रखने के लिए राष्ट्रव्यापी  संगठन के निर्माण हेतु जिसमें संगठन सर्वोच्च हो । सम्पूर्ण भारत में भ्रमण व सम्पर्क के पश्चात समाज के चिन्तनशील बुद्धिजीवियों के विचार – विमर्श के द्वारा महापुरूषों का आन्दोलन व हक वंचित समाज का अस्तित्व बचाने के लिए ” परिवार वाद से मुक्त लोकतंत्र से युक्त ‘ संगठनात्मक जोश से लबरेज नई पीढ़ी के युवा नेतृत्व को उभारने के लिए ” व्यवस्था परिवर्तन ” के लिए समर्पित आजाद समाज पार्टी (कांशीराम), मान्यवर कांशीराम साहब के जन्मदिवस 15 मार्च सन् 2020 को स्थापना की।ताकि देश के साधन – संसाधन और उद्योग – व्यापार के साथ – साथ सरकारी और प्राईवेट सेक्टर की नौकरियों आदि सभी क्षेत्रों में उपेक्षित और वंचित वर्गों को इस देश में हिस्सेदारी मिल सके अर्थात ओ •बी• सी• का 52 प्रतिशत , एस•सी• , एस• टी• का 30 प्रतिशत , अल्पसंख्यकों का 18 प्रतिशत हिस्से के साथ हक़, वंचित वर्गों की सामाजिक आज़ादी , आर्थिक मुक्ति और राजनैतिक पहचान को इस देश में सुनिश्चित किया जा सके । ‘ \n आजाद समाज पार्टी यह प्रतिज्ञा लेकर जनता के बीच में आयी है कि आजाद समाज पार्टी की सरकार आने पर इन प्रतिज्ञाओं को पूरा किया जायेगा अन्यथा विपक्ष में रहकर जनहित के इन मुद्दों के लिए लगातार संघर्ष व आन्दोलन किया जायेगा । ये है हमारी प्रतिज्ञाएं –\n \n 1- किसी भी सरकारी / गैर सरकारी एवं मजदूर की डयूटी के दौरान मौत होने पर उसके परिवार को एक करोड़ रूपए का मुआवजा तथा उसके परिवार के एक सदस्य को उसकी योग्यता अनुसार सरकारी नौकरी दी जाएगी। \n \n 2 . ” राष्ट्रपति हो या मजदूर की संतान शिक्षा हो सबको एक समान ” सिद्धान्त के तहत ‘ समान एवं अनिवार्य शिक्षा ‘ जिसमें सभी के लिए समान पाठ्यक्रम , समान माध्यम एवं समान मूल्यांकन प्रणाली एवं विशेष रूप से भारतीय संविधान के अध्ययन व अध्यापन को बढ़ावा दिया जायेगा । \n\n 3. प्राकृतिक आपदाओं कृषि में सूखा , बाढ़ , ओलावृष्टि इत्यादि में किसानों के साथ – साथ खेतों में काम करने वाले खेतीहर मज़दूरों को भी क्षति – पूर्ति मुआवजा दिया जायेगा । \n \n 4. समाज के कमजोर वर्गो तथा गरीबी रेखा से नीचे जीवन व्यतीत करने वाले परिवारों को मासिक 200 यूनिट , मुफ्त बिजली व फ्री चिकित्सा बीमा के साथ समाज के कमजोर वर्गा की रोटी , कपड़ा, मकान की समुचित व्यवस्था के लिए हम प्रतिबद्ध है ।\n\n 5. प्रदेश के हर गरीब परिवार की लडकियों को 12 वीं तक मुफ्त शिक्षा , वज़ीफ़ा तथा स्कूल कॉलेज तक आने – जाने के लिए फ्री बस सेवा, जिन ग्रामीण इलाको , कसबों में बस सेवा नही होगी वहाँ स्कूल जाने वाली बच्चियों के लिए मुफ्त साईकिल उपलब्ध कराने का काम करेंगे । \n\n 6. कच्ची पक्की कालोनियों व ग्रामीण क्षेत्र के विकास के लिए सड़क नाली – पानी व सीवर विकसित करके स्वच्छ व सुंदर वातावरण बनाया जाएगा । \n\n 7- आजाद भारत के 70 साल बीत जाने पर प्रदेश में अभी भी 8-10 प्रतिशत जनसंख्या झुग्गी, झोपडी , फुटपाथ , रेलवे स्टेशन या फिर खुली छत के नीचे सोने के लिए मजबूर है । ऐसे लोगों के लिए सरकारी खर्च पर रेन बसेरा या फिर उनके लिए छोटे आवास की व्यवस्था करने का काम करेगी । \n\n 8. मॉब लिंचिंग एक तरह की प्रायोजित हिंसा है उसमें शामिल अपराधियों को सख्त सज़ा का कानूनी प्रावधान के साथ ही अल्पसंख्यक समुदाय के विकास के लिए स्कूल मदरसे का विशेष प्रावधान किया जाएगा तथा उनको चलाने के लिए एनजीओ को ग्रांट देकर पिछडे समुदाय को देश की मुख्य विकास धारा में शामिल करने का काम किया जायेगा । \n\n 9. एससी / एसटी / ओबीसी के लिए उपलब्ध संवैधानिक आरक्षण व्यवस्था को जमीनी स्तर पर 100 प्रतिशत लागू करने का काम किया जाएगा । आरक्षण को संविधान की 9वीं अनुसूची में डाला जाए तथा इन वर्गों के लिए निजी क्षेत्रों में भी कम्पलसरी रूप से आरक्षण मिले, इसके लिए कठोर कानूनी प्राविधान किया जायेगा । \n \n 10- ASP प्रदेश में सरकारी विभागों के अंतर्गत लाखों की संख्या में पड़े खाली पदों को सीधी भर्ती के द्वारा भरने का काम करेगी जिसमें आरक्षण को सख़्ती से लागू किया जाएगा । इसके साथ – साथ बेरोजगार नौजवानों के लिए लघु उद्योग चलाने के लिए सस्ती दरों पर सरकारी बैंकों द्वारा लोन उपलब्ध कराकर उद्योग धंधे शुरू करने का काम करेगी जिससे कि अगले पाँच साल में प्रदेश में कोई भी बेरोज़गार नहीं रहेगा \n\n 11- साथ ही निजीकरण को समाप्त करने के लिए हमारी सरकार प्रत्येक विभाग का सरकारीकरण करके उनमें योग्य व देश प्रेमी लोगों की भर्ती कर सरकारी विभागों द्वारा प्रदेश के चहुँमुखी विकास के लिए काम करेगी जिससे पूजीवादी व्यवस्था को खत्म किया जा सके । \n\n12- सरकारी विभागों में लाखों की संख्या में काम कर रहे कच्चे कर्मचारियों का हमारी पार्टी की सरकार बनने के बाद उन्हें 3 महीने के अंदर स्थाई व पक्की नौकरी देने का काम किया जाएगा। \n\n 13- हम महिला सुरक्षा व महिला रोजगार प्लान लाकर महिलाओ को आत्मनिर्भर और स्वावलंबी बनाने का काम करेंगे । इसके साथ ही महिलाओं के लिए 30 प्रतिशत आरक्षण सभी विभागों में लागू किया जायेगा । इतना ही नहीं हमारी सरकार महिलाओं पर हो रहे अत्याचार को समाप्त करने के लिए पुलिस विभाग में 30 प्रतिशत पदों पर महिला कर्मचारियों की नियुक्ति करने का काम करेगी जिससे कि वह स्वयं तथा अन्य महिला वर्ग की सुरक्षा कर सके। \n\n 14 – किसानों को उनकी फसलों का उचित मूल्य तथा एमएसपी लागू करने के लिए हमारी पार्टी की सरकार प्रदेश में किसानों के विकास हेतु कानून बनाएगी तथा मौजूदा सरकार द्वारा किसान विरोधी कानून का बहिष्कार करते हुए प्रदेश में इसे लागू नहीं होने देगी । \n\n 15- मुस्लिम समाज के लिए सच्चर कमेटी की रिपोर्ट पर तुरन्त अमल होना चाहिए । मौजूदा सरकार द्वारा बनाए गए नागरिकता विरोधी कानून ( सी०ए०ए० ) को उत्तर प्रदेश में लागू न करने की गारन्टी तथा प्रत्येक धर्म जाति समुदाय के लोगों को संविधान में दिये गए अधिकार व सुविधाओं को सख़्ती से लागू करने का काम करेगी । \n\n 16- पुलिस के प्रत्येक थाने में एससी / एसटी / ओबीसी / अल्पसंख्यक / महिला वर्ग से एक – एक कर्मचारी की तैनाती की जाएगी जिससे कि पुलिस स्तर पर हो रहे जातिगत अत्याचार को समाप्त किया जा सके । \n\n 17- देश में जो भी पार्टी अडाणी / अंबानी की कम्पनियों का राष्ट्रीयकरण करेगी हमारी पार्टी ऐसे राजनैतिक दल का समर्थन करेगी । \n\n 18- उच्च शिक्षा  संस्थानों में स्वायत्ता घोषित करके वहाँ आरक्षण व्यवस्था को खत्म करने का पडयन्त्र सरकार कर रही है उसे तत्काल रोका जायेगा तथा युवा प्रतिभाओं को निखारने को लिए विदेशी यूनिवर्सिटी में अध्ययन हेतु प्रतिवर्ष 10,000 छात्रों को अध्ययन हेतु सरकारी खर्च पर विदेश में भेजने का कार्य करेगें । \n\n  19 –  सफाई कर्मचारियों की संविदा व्यवस्था ( Contract System ) रद्द करके उनको पहले जैसे सरकारी नौकरी में लिया जाये  \n\n20 – ओबीसी जातियों की जाति आधारित गिनती होनी ही चाहिए । एवं मंडल कमीशन की सभी सिफ़ारिशें पूर्ण रूप से लागू होनी चाहिएँ इसके लिए हम संकल्पबद्ध है। \n\n 22- महंगाई की मार को देखते हुए , टोल प्लाजा टैक्स फ्री करते हुए आजाद समाज पार्टी डीजल , पेट्रोल , रसोईगैस को जीएसटी को दायरे में लाने का काम करेगी तथा प्रदेश सरकार द्वारा लगाई जा रही भरकम टैक्स डयूटी को कम करके डीज़ल पेट्रोल को 40 से 50 रूपये प्रति लीटर देने के साथ साथ रसोई गैस की कीमत को आम उपभोक्ता के दायरे में लाने का काम करेगी । ",
                              style: TextStyle(fontSize: 16),
                            ),
                          ),
                          Padding(
                            padding: const EdgeInsets.symmetric(
                                horizontal: 04, vertical: 10),
                            child: Column(
                              crossAxisAlignment: CrossAxisAlignment.start,
                              children: [
                                Text(
                                  '” जीना कोई बहुत बड़ी बात नहीं , बड़ी बात है स्वाभिमान से जीना।”',
                                  style: TextStyle(
                                      fontSize: 16,
                                      fontWeight: FontWeight.w900),
                                ),
                                Text(
                                  '– बाबा साहब डा ० भीम राव अम्बेडकर ।',
                                  style: TextStyle(fontSize: 16),
                                ),
                              ],
                            ),
                          ),
                          Padding(
                            padding: const EdgeInsets.symmetric(
                                horizontal: 04, vertical: 10),
                            child: Text(
                              ' "जगाया उसे जाता है जो ज़िंदा होते है मरे हुओ को तो दफनाया या जलाया जाता है ।"',
                              style: TextStyle(
                                  fontSize: 16, fontWeight: FontWeight.w900),
                            ),
                          ),
                          Padding(
                            padding: const EdgeInsets.symmetric(
                                horizontal: 04, vertical: 10),
                            child: Column(
                              crossAxisAlignment: CrossAxisAlignment.start,
                              children: [
                                Text(
                                  '”जिन्दा हो तो नजर आओं नहीं तो दुनिया आपको मरा हुआ समझ लेगी और आपको मिट्टी में दफना देगी “',
                                  style: TextStyle(
                                      fontSize: 16,
                                      fontWeight: FontWeight.w900),
                                ),
                                Text(
                                  '– बहुजन नायक मान्यवर कांशीराम',
                                  style: TextStyle(fontSize: 16),
                                ),
                              ],
                            ),
                          ),
                        ],
                      )
                    ],
                  )),
            ),
          ),
        ),
      ),
    );
    ;
  }
}
